Revit 2027 API
IFCLegacyStairOrRamp.GetBoundaryLines Method
 Gets boundary lines.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetBoundaryLines()
Public Function GetBoundaryLines As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetBoundaryLines()
member GetBoundaryLines : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The boundary lines.
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace